docs/README.org
#+STARTUP: showall
#+TITLE: hledger-makeitso: Step By Step
#+PROPERTY: header-args:sh :prologue exec 2>&1 :epilogue echo :

* About This Document

This document is a [[https://www.offerzen.com/blog/literate-programming-empower-your-writing-with-emacs-org-mode][literate]] [[https://orgmode.org/worg/org-contrib/babel/intro.html][program]].
You can read it like a normal article.

But you can also open [[file:README.org][this org-mode file]] in emacs,
and execute each code snippet by pressing =C-c C-c= with your cursor on the relevant code block.

* The Story of an African Chef

Meet Gawie de Groot. Gawie is a successful [[https://en.wikipedia.org/wiki/Gonimbrasia_belina#As_food][mopane worm]] chef, based in the northernmost section of the [[https://en.wikipedia.org/wiki/Kruger_National_Park][Kruger National Park]].

In the past he used to work in a big city as an IT professional, but after a few years of this he decided to choose a quiter life
in the bushveld.

He now works at a renowned bush restaurant aptly named the "=Grillerige Groen Goggatjie=".

Demand for his traditional African cuisine has sky-rocketed, with visitors from all over Zimbabwe, Mozambique and South Africa
coming to enjoy his dishes.

Business has been good the last few years, but Gawie wants to make sure that he'll also be OK when business is down.

It is time for Gawie to take charge of his finances.

