docs/README.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>hledger-makeitso: Step By Step</title>
<link rel="stylesheet" href="./reveal.js/css/reveal.css"/>

<link rel="stylesheet" href="./reveal.js/css/theme/beige.css" id="theme"/>


<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide"><h1 class="title">hledger-makeitso: Step By Step</h1><p class="date">Created: 2018-09-25 Tue 23:33</p>
</section>
<section id="table-of-contents">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#/slide-orgbefc073">About This Document</a></li>
<li><a href="#/slide-orgb2f6845">The Story of an African Chef</a></li>
<li><a href="#/slide-orgb332099">Part 1: The First CSV Statement</a></li>
<li><a href="#/slide-orga6a041b">Part 2: Adding More Statements</a></li>
</ul>
</div>
</div>
</section>

<section>
<section id="slide-orgbefc073">
<h2 id="orgbefc073">About This Document</h2>
<p>
This document is a <a href="https://www.offerzen.com/blog/literate-programming-empower-your-writing-with-emacs-org-mode">literate</a> <a href="https://orgmode.org/worg/org-contrib/babel/intro.html">program</a>.
You can read it like a normal article.
</p>

<p>
But you can also open <a href="README.html">this org-mode file</a> in emacs,
and execute each code snippet by pressing <code>C-c C-c</code> with your cursor on the relevant code block.
</p>

</section>
</section>
<section>
<section id="slide-orgb2f6845">
<h2 id="orgb2f6845">The Story of an African Chef</h2>
<p>
Meet Gawie de Groot. Gawie is a successful <a href="https://en.wikipedia.org/wiki/Gonimbrasia_belina#As_food">mopane worm</a> chef, based in the northernmost section of the <a href="https://en.wikipedia.org/wiki/Kruger_National_Park">Kruger National Park</a>.
</p>

<p>
In the past he used to work in a big city as an IT professional, but after a few years of this he decided to choose a quiter life
in the bushveld.
</p>

<p>
He now works at a renowned bush restaurant aptly named the "<code>Grillerige Groen Goggatjie</code>".
</p>

</section>
<section >

<p>
Demand for his traditional African cuisine has sky-rocketed, with visitors from all over Zimbabwe, Mozambique and South Africa
coming to enjoy his dishes.
</p>

<p>
Business has been good the last few years, but Gawie wants to make sure that he'll also be OK when business is down.
</p>

<p>
It is time for Gawie to take charge of his finances.
</p>

</section>
</section>
